Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_2 (Conv2D)           (None, 25, 25, 8)         136       
                                                                 
 conv2d_3 (Conv2D)           (None, 22, 22, 4)         516       
                                                                 
 flatten_1 (Flatten)         (None, 1936)              0         
                                                                 
 dense_1 (Dense)             (None, 10)                19370     
                                                                 
=================================================================
Total params: 20022 (78.21 KB)
Trainable params: 20022 (78.21 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 25, 25, 8)         136       
                                                                 
 conv2d_1 (Conv2D)           (None, 22, 22, 4)         516       
                                                                 
 flatten (Flatten)           (None, 1936)              0         
                                                                 
 dense (Dense)               (None, 10)                19370     
                                                                 
=================================================================
Total params: 20022 (78.21 KB)
Trainable params: 20022 (78.21 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
