Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 13, 13, 8)         80        
                                                                 
 conv2d_1 (Conv2D)           (None, 6, 6, 4)           292       
                                                                 
 flatten (Flatten)           (None, 144)               0         
                                                                 
 dense (Dense)               (None, 10)                1450      
                                                                 
=================================================================
Total params: 1822 (7.12 KB)
Trainable params: 1822 (7.12 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
