Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 24, 24, 8)         208       
                                                                 
 conv2d_1 (Conv2D)           (None, 20, 20, 4)         804       
                                                                 
 flatten (Flatten)           (None, 1600)              0         
                                                                 
 dense (Dense)               (None, 10)                16010     
                                                                 
=================================================================
Total params: 17022 (66.49 KB)
Trainable params: 17022 (66.49 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
