Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 9, 9, 8)           80        
                                                                 
 conv2d_1 (Conv2D)           (None, 3, 3, 4)           292       
                                                                 
 flatten (Flatten)           (None, 36)                0         
                                                                 
 dense (Dense)               (None, 10)                370       
                                                                 
=================================================================
Total params: 742 (2.90 KB)
Trainable params: 742 (2.90 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
